Rails_test/test1/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "aiueo"], ["content", "kakikukeko"], ["created_at", "2023-10-14 00:38:06.376522"], ["updated_at", "2023-10-14 00:38:06.376522"]]
---
    def create
        @post = Post.new(post_params)
        if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "編集済み1"], ["content", "編集済み1"], ["updated_at", "2023-10-13 11:55:59.503951"], ["id", 1]]
---
    def update
        if @post.update(post_params)